Revit 2027 API
RevitLinkType.LoadFrom Method
Overload List
Name | Description
LoadFrom(ExternalResourceReference, WorksetConfiguration) |  Loads or reloads the Revit link. The link will be loaded from the location given in the input ExternalResourceReference.
LoadFrom(ModelPath, WorksetConfiguration) |  Loads or reloads the Revit link from disk or cloud. The link will be loaded from the input path.
Top
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace